# CannotCopySunAndShadowSettings Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopySunAndShadowSettings Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
SunAndShadowSettings cannot be copied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopySunAndShadowSettings { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopySunAndShadowSettings As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopySunAndShadowSettings {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace